---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
WorksetConfiguration Properties
WorksetConfiguration Class See Also Send Feedback
---

The WorksetConfiguration type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

WorksetConfiguration Class

Autodesk.Revit.DB Namespace